applications/solvers/multiphase/phaseChangeHeatFoam/Validation/HorizontalFilm/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
   upDown
    {
	type	empty;	
    }

   right
    {
	type            zeroGradient;
	inletValue	uniform (0 0 0);  
	value		uniform (0 0 0);   
    }
    	
   left
    {
	type            fixedValue;
        value           uniform (0 0 0);    
    }
   
 frontAndBack 
    {
	type	empty; 
    }

}

// ************************************************************************* //
