applications/solvers/multiphase/phaseChangeHeatFoam/Validation/HorizontalFilm/0/alpha1.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    upDown
    {
	type	empty;
    }

   right
   {
      type	zeroGradient; 
   }

   left
    {
	type	fixedValue;
	value	uniform 1.0
    }

   frontAndBack 
    {
	type	empty; 
    }

}

// ************************************************************************* //
